# Для правильной работы скрипта заполните значения db_name, user, password.
# Они нужны для первичного подключения к базе данных и работы с ней.

# Пример:
# db_name, user, password = "test_database", "test_user", "test_password"
# Учтите, что введенные данные должны быть корректными, иначе возникнет ошибка
# несуществующей базы данных.

db_name = 'test'  # - заполнить обязательно существующей базой данных.
host = '127.0.0.1'
user = 'test_user'  # - заполнить обязательно существующим user-ом.
password = 'password'  # - заполнить для входа в бд
port = '5432'
